---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.PartType
source: html/798cb715-a76a-1a2e-7162-abba4f773337.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.PartType Property

The part type of the duct fitting or duct accessory.

## Syntax (C#)
```csharp
public PartType PartType { get; }
```